# IsModified Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsModified Method
AnalyticalModel Class See Also
---
Checks if AM has been adjusted from auto-detect at any end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsModified()
```

Visual Basic
---
```text
Public Function IsModified As Boolean
```

Visual C++
---
```text
public:
bool IsModified()
```

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace